In [3]:
import pandas as pd
import numpy as np

In [53]:
### 데이터 프레임 생성 문제1 : df1 생성
# - 데이터 : numpy 패키지의 randn 함수를 이용해서 난수 n 개 생성
# - 행방향 인덱스(index) : 날짜 데이터
# - 열방향 인덱스(column) : ['A','B','C','D']

In [5]:
#2019년 1월1일 이후 일요일 날짜 6개를 생성하여 저장하시오
dates = pd.date_range('2019-01-06',periods=6,freq='w')
dates

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27',
               '2019-02-03', '2019-02-10'],
              dtype='datetime64[ns]', freq='W-SUN')

In [7]:
# 6x4 랜덤수
np.random.rand(6,4)

array([[0.90380659, 0.57674059, 0.11562582, 0.8701795 ],
       [0.04179342, 0.90482727, 0.06549223, 0.79960611],
       [0.83434096, 0.96908789, 0.37436967, 0.67979316],
       [0.05052465, 0.3681518 , 0.60389079, 0.7955765 ],
       [0.1115116 , 0.00244434, 0.02773921, 0.64628555],
       [0.79074896, 0.33995816, 0.51920287, 0.71398927]])

In [8]:
#아래와 같은 DataFrame을 생성 하시오
df1=pd.DataFrame(np.random.rand(6,4), index=dates,columns=['A','B','C','D'])
df1

                   A         B         C         D
2019-01-06  0.276468  0.576888  0.681803  0.627640
2019-01-13  0.445133  0.748293  0.577011  0.871503
2019-01-20  0.615337  0.196401  0.834637  0.053775
2019-01-27  0.730263  0.222729  0.859438  0.869270
2019-02-03  0.681797  0.397628  0.684279  0.119823
2019-02-10  0.502669  0.061329  0.281017  0.621968

In [60]:
import warnings
# 경고메세지 끄기
warnings.filterwarnings(action='ignore')

# 다시 출력하게 하기
# warnings.filterwarnings(action='default')

In [61]:
# 필요 패키지 import
import pandas as pd
import numpy as np
import datetime as datetime

In [10]:
# 예제 df4 생성
data = [[22, 60.1, 170.5, '남', '서울'], 
        [45, 51.3, 157.3, '여', '부산'], 
        [22, 68.3, 180.1, '남', '대구'],
        [33, 88.3, 190.2, '남', '제주'], 
        [27, 48.3, 160.1, '여', '강릉']]
df4 = pd.DataFrame(data, index=['홍길동', '이몽룡', '성춘향','변학도', '김연아'], 
                   columns=["나이", "몸무게", "키", "성별" ,"주소"])
df4

     나이   몸무게      키 성별  주소
홍길동  22  60.1  170.5  남  서울
이몽룡  45  51.3  157.3  여  부산
성춘향  22  68.3  180.1  남  대구
변학도  33  88.3  190.2  남  제주
김연아  27  48.3  160.1  여  강릉

##### 데이터프레임 전치 문제
- df4 데이터프레임을 전치 후에 df4_1로 저장하고 원본과 비교 출력 하시오.
- 열기준 다 같은 타입(문자열)으로 바뀜

display() : 주피터가 가지고 있는 HTML으로 데이터프레임 출력

In [18]:
df4_1 = df4.T
display(df4)

     나이   몸무게      키 성별  주소
홍길동  22  60.1  170.5  남  서울
이몽룡  45  51.3  157.3  여  부산
성춘향  22  68.3  180.1  남  대구
변학도  33  88.3  190.2  남  제주
김연아  27  48.3  160.1  여  강릉

In [19]:
df4_1

       홍길동    이몽룡    성춘향    변학도    김연아
나이      22     45     22     33     27
몸무게   60.1   51.3   68.3   88.3   48.3
키    170.5  157.3  180.1  190.2  160.1
성별       남      여      남      남      여
주소      서울     부산     대구     제주     강릉

#### 인덱싱 문제 (기본인덱싱)
- 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나  처리하라.

In [21]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70]
}

columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]

df = pd.DataFrame(data, index=index, columns=columns)

#문1.  모든 학생의 수학 점수를 시리즈로 나타낸다.
#문2.  모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
#문3.  모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
#문4.  방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
#문5.  춘향의 점수를 데이터프레임으로 나타낸다.
#문6.  향단의 점수를 시리즈로 나타낸다.

In [22]:
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

기본인덱스는 열 인덱스기준, 하나의 열은 시리즈

In [24]:
# 모든 학생의 수학 점수를 시리즈로 나타낸다. 
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

부분집합은 데이터프레임이 된다, df['국어,'영어]가 아니라 인덱스를 리스트로 묶어야한다.

In [29]:
# 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  80

새로운열 추가는 그냥 새로운열을 정의하고 값을 할당하면 된다.

In [30]:
# 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

df['평균점수']=(df['국어']+df['영어']+df['수학'])/3
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

pd.options.display.float_format : 소수점이하 포맷

In [31]:
#pandas 출력 포맷팅 : 소수점이하 2자리
pd.options.display.float_format = '{:.2f}'.format
df

    국어  영어  수학  평균점수
춘향  80  90  90 86.67
몽룡  90  70  60 73.33
향단  70  60  80 70.00
방자  30  80  70 60.00

In [32]:
#정한 표기법을 원래 상태로 복귀 : None를 지정
pd.set_option('display.float_format',None)
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [33]:
# 방자의 영어 점수를 80점으로 수정하고 평균 점수도 
# 다시 계산한다.

df.loc['방자','영어']=80
df['평균점수']=(df['국어']+df['영어']+df['수학'])/3
df

    국어  영어  수학       평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [34]:
행접근 
- 첫번째 컬럼(컬럼명:N) 일 경우 :N

SyntaxError: invalid syntax (CreatorTemp/ipykernel_37116/3361253603.py, line 2)

In [40]:
# 춘향의 점수를 데이터프레임으로 나타낸다.
df.loc[['춘향']]
#display(df[:'춘향'])

# 몽룡의 점수를 데이터 프레임으로 나타내는 경우
df.loc[['몽룡']]
#display(df['몽룡':'몽룡'])

    국어  영어  수학       평균점수
몽룡  90  70  60  73.333333

In [43]:
#향단의 점수 시리즈로
#시리즈는 열방향 데이터일 경우에 추출 가능
#전치는 원본에 반영되지 않는다
#df.loc['향단']
df.T['향단']

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
Name: 향단, dtype: float64